HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxPort_bf.h
/** \\brief  Length for Ifx_P_IOCR12_Bits.PC13 */
#define IFX_P_IOCR12_PC13_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR12_Bits.PC13 */
#define IFX_P_IOCR12_PC13_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR12_Bits.PC13 */
#define IFX_P_IOCR12_PC13_OFF (11)

/** \\brief  Length for Ifx_P_IOCR12_Bits.PC14 */
#define IFX_P_IOCR12_PC14_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR12_Bits.PC14 */
#define IFX_P_IOCR12_PC14_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR12_Bits.PC14 */
#define IFX_P_IOCR12_PC14_OFF (19)

/** \\brief  Length for Ifx_P_IOCR12_Bits.PC15 */
#define IFX_P_IOCR12_PC15_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR12_Bits.PC15 */
#define IFX_P_IOCR12_PC15_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR12_Bits.PC15 */
#define IFX_P_IOCR12_PC15_OFF (27)

/** \\brief  Length for Ifx_P_IOCR4_Bits.PC4 */
#define IFX_P_IOCR4_PC4_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR4_Bits.PC4 */
#define IFX_P_IOCR4_PC4_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR4_Bits.PC4 */
#define IFX_P_IOCR4_PC4_OFF (3)

/** \\brief  Length for Ifx_P_IOCR4_Bits.PC5 */
#define IFX_P_IOCR4_PC5_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR4_Bits.PC5 */
#define IFX_P_IOCR4_PC5_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR4_Bits.PC5 */
#define IFX_P_IOCR4_PC5_OFF (11)

/** \\brief  Length for Ifx_P_IOCR4_Bits.PC6 */
#define IFX_P_IOCR4_PC6_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR4_Bits.PC6 */
#define IFX_P_IOCR4_PC6_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR4_Bits.PC6 */
#define IFX_P_IOCR4_PC6_OFF (19)

/** \\brief  Length for Ifx_P_IOCR4_Bits.PC7 */
#define IFX_P_IOCR4_PC7_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR4_Bits.PC7 */
#define IFX_P_IOCR4_PC7_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR4_Bits.PC7 */
#define IFX_P_IOCR4_PC7_OFF (27)

/** \\brief  Length for Ifx_P_IOCR8_Bits.PC10 */
#define IFX_P_IOCR8_PC10_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR8_Bits.PC10 */
#define IFX_P_IOCR8_PC10_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR8_Bits.PC10 */
#define IFX_P_IOCR8_PC10_OFF (19)

/** \\brief  Length for Ifx_P_IOCR8_Bits.PC11 */
#define IFX_P_IOCR8_PC11_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR8_Bits.PC11 */
#define IFX_P_IOCR8_PC11_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR8_Bits.PC11 */
#define IFX_P_IOCR8_PC11_OFF (27)

/** \\brief  Length for Ifx_P_IOCR8_Bits.PC8 */
#define IFX_P_IOCR8_PC8_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR8_Bits.PC8 */
#define IFX_P_IOCR8_PC8_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR8_Bits.PC8 */
#define IFX_P_IOCR8_PC8_OFF (3)

/** \\brief  Length for Ifx_P_IOCR8_Bits.PC9 */
#define IFX_P_IOCR8_PC9_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR8_Bits.PC9 */
#define IFX_P_IOCR8_PC9_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR8_Bits.PC9 */
#define IFX_P_IOCR8_PC9_OFF (11)

/** \\brief  Length for Ifx_P_LPCR0_Bits.PS1 */
#define IFX_P_LPCR0_PS1_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR0_Bits.PS1 */
#define IFX_P_LPCR0_PS1_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR0_Bits.PS1 */
#define IFX_P_LPCR0_PS1_OFF (1)

/** \\brief  Length for Ifx_P_LPCR1_P21_Bits.LRXTERM */
#define IFX_P_LPCR1_P21_LRXTERM_LEN (5)

/** \\brief  Mask for Ifx_P_LPCR1_P21_Bits.LRXTERM */
#define IFX_P_LPCR1_P21_LRXTERM_MSK (0x1f)

/** \\brief  Offset for Ifx_P_LPCR1_P21_Bits.LRXTERM */
#define IFX_P_LPCR1_P21_LRXTERM_OFF (3)

/** \\brief  Length for Ifx_P_LPCR1_P21_Bits.RDIS_CTRL */
#define IFX_P_LPCR1_P21_RDIS_CTRL_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR1_P21_Bits.RDIS_CTRL */
#define IFX_P_LPCR1_P21_RDIS_CTRL_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR1_P21_Bits.RDIS_CTRL */
#define IFX_P_LPCR1_P21_RDIS_CTRL_OFF (0)

/** \\brief  Length for Ifx_P_LPCR1_P21_Bits.RX_DIS */
#define IFX_P_LPCR1_P21_RX_DIS_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR1_P21_Bits.RX_DIS */
#define IFX_P_LPCR1_P21_RX_DIS_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR1_P21_Bits.RX_DIS */
#define IFX_P_LPCR1_P21_RX_DIS_OFF (1)

/** \\brief  Length for Ifx_P_LPCR1_P21_Bits.TERM */
#define IFX_P_LPCR1_P21_TERM_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR1_P21_Bits.TERM */
#define IFX_P_LPCR1_P21_TERM_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR1_P21_Bits.TERM */
#define IFX_P_LPCR1_P21_TERM_OFF (2)

/** \\brief  Length for Ifx_P_LPCR1_Bits.PS1 */
#define IFX_P_LPCR1_PS1_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR1_Bits.PS1 */
#define IFX_P_LPCR1_PS1_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR1_Bits.PS1 */
#define IFX_P_LPCR1_PS1_OFF (1)

/** \\brief  Length for Ifx_P_LPCR2_Bits.LVDSR */
#define IFX_P_LPCR2_LVDSR_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.LVDSR */
#define IFX_P_LPCR2_LVDSR_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.LVDSR */
#define IFX_P_LPCR2_LVDSR_OFF (8)

/** \\brief  Length for Ifx_P_LPCR2_Bits.LVDSRL */
#define IFX_P_LPCR2_LVDSRL_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.LVDSRL */
#define IFX_P_LPCR2_LVDSRL_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.LVDSRL */
#define IFX_P_LPCR2_LVDSRL_OFF (9)

/** \\brief  Length for Ifx_P_LPCR2_Bits.TDIS_CTRL */
#define IFX_P_LPCR2_TDIS_CTRL_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.TDIS_CTRL */
#define IFX_P_LPCR2_TDIS_CTRL_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.TDIS_CTRL */
#define IFX_P_LPCR2_TDIS_CTRL_OFF (12)

/** \\brief  Length for Ifx_P_LPCR2_Bits.TX_DIS */
#define IFX_P_LPCR2_TX_DIS_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.TX_DIS */
#define IFX_P_LPCR2_TX_DIS_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.TX_DIS */
#define IFX_P_LPCR2_TX_DIS_OFF (13)

/** \\brief  Length for Ifx_P_LPCR2_Bits.TX_PD */
#define IFX_P_LPCR2_TX_PD_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.TX_PD */
#define IFX_P_LPCR2_TX_PD_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.TX_PD */
#define IFX_P_LPCR2_TX_PD_OFF (14)

/** \\brief  Length for Ifx_P_LPCR2_Bits.TX_PWDPD */
#define IFX_P_LPCR2_TX_PWDPD_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.TX_PWDPD */
#define IFX_P_LPCR2_TX_PWDPD_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.TX_PWDPD */
#define IFX_P_LPCR2_TX_PWDPD_OFF (15)

/** \\brief  Length for Ifx_P_OMCR0_Bits.PCL0 */
#define IFX_P_OMCR0_PCL0_LEN (1)

